app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2016-04-28 17:12:52.922392"], ["updated_at", "2016-04-28 17:12:52.922392"]]
---
  def create
    @order = Order.create(total:params[:grandTotal], user_id:session[:id])