app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @products = Product.all
    if session[:id]
      @user = User.find(session[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 8]]
---
  def show
    @products ||= []
    if session[:cartItems]
      for idx in session[:cartItems]
        @products.push(Product.find(idx))