app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "s@g.com"]]
---
  def create
   @loggedIn = User.find_by_email(params[:email])